In [1]:
import numpy as np 
import pandas as pd

In [2]:
myindex = ['이순신', '김유신', '강감찬', '광해군', '연산군']
mycolumns = ['서울', '부산', '광주', '목포', '경주']
mylist = list( 10 * onedata for onedata in range(1, 26))
print(mylist)

[10, 20, 30, 40, 50, 60, 70, 80, 90, 100, 110, 120, 130, 140, 150, 160, 170, 180, 190, 200, 210, 220, 230, 240, 250]

In [3]:
myframe = pd.DataFrame( np.reshape(mylist, (5, 5)), index=myindex, columns = mycolumns  )
myframe

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [33]:
type(myframe)

pandas.core.frame.DataFrame

In [34]:
type(myframe.iloc[0])

pandas.core.series.Series

In [10]:
# 1 행만 Series로 읽어 오기') -> 결과값은 Series
result = myframe.iloc[1]
type(result)
print(result)
print(type(myframe.iloc[1]))
print(type(myframe))

서울     60
부산     70
광주     80
목포     90
경주    100
Name: 김유신, dtype: int32
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [9]:
# 몇개의 행을 읽어 오기')
result = myframe.iloc[[1,3]]
type(result)
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
광해군  160  170  180  190  200

In [10]:
# 짝수행만 가져 오기')
result = myframe.iloc[0::2]
result

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
강감찬  110  120  130  140  150
연산군  210  220  230  240  250

In [15]:
# 홀수행만 가져 오기 
# 이순신 행만 Series로 읽어 오기
result = myframe.loc['이순신']
print(result)
print(type(result))

서울    10
부산    20
광주    30
목포    40
경주    50
Name: 이순신, dtype: int32
<class 'pandas.core.series.Series'>

In [17]:
# 이순신 행만 DataFrame으로 읽어 오기
result = myframe.loc[['이순신']]
print(type(result))
result

<class 'pandas.core.frame.DataFrame'>

     서울  부산  광주  목포  경주
이순신  10  20  30  40  50

In [18]:
# 강감찬와 이순신 행 읽어 오기
# 여러행을 가져오면 DataFrame이 됨
result = myframe.loc[['이순신', '강감찬']]
print(type(result))
result

<class 'pandas.core.frame.DataFrame'>

      서울   부산   광주   목포   경주
이순신   10   20   30   40   50
강감찬  110  120  130  140  150

In [14]:
myframe.index
#문자열은 object로 판정됨

Index(['이순신', '김유신', '강감찬', '광해군', '연산군'], dtype='object')

In [ ]:
help(np.random.choice)

In [15]:
# np.random.choice는 NumPy 라이브러리의 함수로, 주어진 1차원 배열에서 랜덤하게 요소를 선택하는 데 사용됩니다. 
# 이 함수는 무작위 샘플링을 할 수 있도록 도와줍니다. 
# numpy.random.choice(a, size=None, replace=True, p=None)
# 매개변수 설명
#     a: 1차원 배열 또는 정수.
#         정수일 경우, 0부터 a-1까지의 정수에서 선택합니다.
#         배열일 경우, 배열의 요소 중에서 선택합니다.
#     size: 선택할 샘플의 개수. 기본값은 None으로, 이 경우 단일 값을 반환합니다. 배열로 지정하면 그 크기의 배열을 반환합니다.
#     replace: 불리언 값. True이면 선택한 요소를 다시 선택할 수 있습니다 (복원 추출). False이면 선택한 요소는 다시 선택할 수 없습니다 (비복원 추출). 기본값은 True입니다.
#     p: 배열. 각 요소가 선택될 확률을 지정하는 배열입니다. p의 합은 1이어야 하며, 기본값은 균등 분포입니다.
mytarget = np.random.choice(myframe.index, 3)
mytarget

array(['김유신', '강감찬', '김유신'], dtype=object)

In [16]:
result = myframe.loc[ mytarget ]
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
김유신   60   70   80   90  100

In [22]:
# 강감찬의  광주 실적 정보 가져 오기
result = myframe.loc[['강감찬'], ['광주']] # DataFrame
result

# result = myframe.loc['강감찬', '광주']
# result

130

In [18]:
# 연산군와 광해군의 광주/목포 정보 가져 오기
result = myframe.loc[['연산군', '강감찬'], ['광주', '목포']]
result

      광주   목포
연산군  230  240
강감찬  130  140

In [19]:
# 연속적인 데이터 가져 오기
result = myframe.loc['김유신':'광해군', '광주':'목포']
result

      광주   목포
김유신   80   90
강감찬  130  140
광해군  180  190

In [20]:
# 김유신~광해군까지  부산 실적 정보 가져 오기
result = myframe.loc['김유신':'광해군', ['부산']]
result

      부산
김유신   70
강감찬  120
광해군  170

In [21]:
# Boolean으로 데이터 처리하기
result = myframe.loc[[False, True, True, False, True]]
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
연산군  210  220  230  240  250

In [22]:
# 부산 실적이 100이하인 항목들
result = myframe.loc[ myframe['부산'] <= 100 ]
result

     서울  부산  광주  목포   경주
이순신  10  20  30  40   50
김유신  60  70  80  90  100

In [23]:
# 목포 실적이 140인 항목들
result = myframe.loc[ myframe['목포'] == 140 ]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150

In [23]:
cond1 = myframe['부산'] >= 70
cond2 = myframe['목포'] >= 140

type(cond1)

pandas.core.series.Series

In [24]:
cond1

이순신    False
김유신     True
강감찬     True
광해군     True
연산군     True
Name: 부산, dtype: bool

In [25]:
cond2

이순신    False
김유신    False
강감찬     True
광해군     True
연산군     True
Name: 목포, dtype: bool

In [26]:
df = pd.DataFrame([cond1, cond2])
df

      이순신    김유신   강감찬   광해군   연산군
부산  False   True  True  True  True
목포  False  False  True  True  True

In [ ]:
df.all?

In [27]:
# 모든 요소가 True인지 판단 (둘다 True여야만 True라고 생각하면 편함)
# df.all(
#     axis: 'Axis | None' = 0,
#     bool_only: 'bool' = False,
#     skipna: 'bool' = True,
#     **kwargs,
# ) -> 'Series | bool'
# axis의 기본값이 0 : 행을 비교
df.all()

이순신    False
김유신    False
강감찬     True
광해군     True
연산군     True
dtype: bool

In [30]:
df.all(axis=1)

부산    False
목포    False
dtype: bool

In [28]:
# 하나라도 True인지 판단 ( or )
# 기본 문법은 all과 같음
df.any()

이순신    False
김유신     True
강감찬     True
광해군     True
연산군     True
dtype: bool

In [30]:
result = myframe.loc[ df.all() ]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [31]:
result = myframe.loc[ df.any() ]
result

      서울   부산   광주   목포   경주
김유신   60   70   80   90  100
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [ ]:
#  	    이순신 	김유신 	강감찬 	광해군 	연산군
# 부산 	False 	True 	True 	True 	True
# 목포 	False 	False 	True 	True 	True

In [32]:
df

      이순신    김유신   강감찬   광해군   연산군
부산  False   True  True  True  True
목포  False  False  True  True  True

In [31]:
# 람다 함수의 사용
# 결과값이 boolean indexing 형태면 다 올수 있음
# 여기서의 df는 매개변수임. 위의 df가 아니다
result = myframe.loc[ lambda df : df['광주'] >= 130  ]
result

      서울   부산   광주   목포   경주
강감찬  110  120  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [33]:
# 이순신과 강감찬의 부산 실적을 30으로 변경하기
myframe.loc[['이순신', '강감찬'], ['부산']] = 30
myframe

      서울   부산   광주   목포   경주
이순신   10   30   30   40   50
김유신   60   70   80   90  100
강감찬  110   30  130  140  150
광해군  160  170  180  190  200
연산군  210  220  230  240  250

In [34]:
## 김유신부터 광해군까지 경주 실적을 80으로 변경하시오.
myframe.loc['김유신':'광해군', ['경주']] = 80
myframe

      서울   부산   광주   목포   경주
이순신   10   30   30   40   50
김유신   60   70   80   90   80
강감찬  110   30  130  140   80
광해군  160  170  180  190   80
연산군  210  220  230  240  250

In [35]:
# 연산군의 모든 실적을 50으로 변경하기
myframe.loc[['연산군'], :] = 50
myframe

      서울   부산   광주   목포  경주
이순신   10   30   30   40  50
김유신   60   70   80   90  80
강감찬  110   30  130  140  80
광해군  160  170  180  190  80
연산군   50   50   50   50  50

In [36]:
# 모든 사람의 광주 컬럼을 60으로 변경하기
myframe.loc[:, ['광주']] = 60
myframe

      서울   부산  광주   목포  경주
이순신   10   30  60   40  50
김유신   60   70  60   90  80
강감찬  110   30  60  140  80
광해군  160  170  60  190  80
연산군   50   50  60   50  50

In [37]:
# 경주 실적이 150이하인 데이터를 모두 0으로 변경하기
myframe.loc[myframe['경주'] <= 150 , ['경주', '광주']] = 0
myframe

      서울   부산  광주   목포  경주
이순신   10   30   0   40   0
김유신   60   70   0   90   0
강감찬  110   30   0  140   0
광해군  160  170   0  190   0
연산군   50   50   0   50   0

In [38]:
# 데이터 프레임 사용하기
myframe

      서울   부산  광주   목포  경주
이순신   10   30   0   40   0
김유신   60   70   0   90   0
강감찬  110   30   0  140   0
광해군  160  170   0  190   0
연산군   50   50   0   50   0